#1

#a = "choo"
#b = "202430952"

#print(a +b)
#----------------
#2

#a = int(input())
#if a%2 == 0:
#  print("even")
#else:
#  print("odd")
#----------------

#3
#for i in range(1, 10):
#  print(f"5 x {i} = {i*5}")

#4
#a = [10,20,30]
#b = a
#a[1] = "Computer"
#print(b[1], a[0])

#Computer 10
#----------------

#5
#class Point:
#  def __init__(self, x, y):
#    self.x = x
#    self.y = y
#p = Point(2,3)
#print(p) #"(2,3)"

#def __str__(self):
#    return f"({self.x},{self.y})"
#----------------


#11
#1)단순 연결 리스트
#2)이중 연결 리스트
#3)원형 연결 리스트
#4)o(n)이다.
#----------------

#12
#3. 배열에 비해 메모리 사용이 적어 더 효율적이다.(아님.)
# 늘어난다.
#----------------

#13
# 2.새 항목을 리스트의 마지막 노드로 삽입 
# 4.리스트의 마지막 노드 삭제
#----------------

#14
#

#15
#2.이중 연결 리스트


